Documents/НачислениеЭлектроэнергии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>НачислениеЭлектроэнергии</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыСЭлектросетью</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРаспределенияПерерасхода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийТариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаАдминистрирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщееПотреблениеКвт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндивидуальноеПотреблениеКвт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерерасходКвт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБоксов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщееПотреблениеУчетноеКвт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентыВводов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Бокс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Собственник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Владельцы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвтИндивидуально</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвтОДН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифПримененный</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИндивидуально</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОДН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИтого</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ввод</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВводыЭлектроснабжения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СпособыРаспределенияПерерасхода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыРаспределенияПерерасхода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПересчетТарифа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоровнуНаБоксы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/НачислениеЭлектроэнергии/Ext/ManagerModule.bsl
Функция ПечатьКвитанций(ДокСсылка) Экспорт
	 ДокОбъект = ДокСсылка.ПолучитьОбъект();
	 Макет = ДокОбъект.ПолучитьМакет("Квитанция");
	 ТабДок = Новый ТабличныйДокумент;
	 ОблШапка  = Макет.ПолучитьОбласть("Шапка");
	 ОблНачисления = Макет.ПолучитьОбласть("СтрокаНачисления");
	 ОблОДН = Макет.ПолучитьОбласть("СтрокаОДН");
	 ОблИтог = Макет.ПолучитьОбласть("СтрокаИтог");
	 ОблИтого   = Макет.ПолучитьОбласть("Итог");
	 
	 //предрасчёты по вводам: потери на бокс (для информационной строки)
	 ПотериПоВВодам = Новый Соответствие;
	 Для Каждого Стр Из ДокСсылка.Начисления Цикл 
		 Если Не ПотериПоВВодам.Получить(Стр.Ввод)= Неопределено и Не Стр.Ввод.Пустая() Тогда
			 Коэф = Стр.Ввод.КоэффициентПотерь;
			 Если Коэф <= 0 Тогда
				 Коэф = 1;
			 КонецЕсли;
			 //физический расход ввода = учётный / коэф (обратный пересчёт)
			 Физич = ДокСсылка.ОбщееПотреблениеУчетноеКвт / Коэф;
			 ПотериПоВВодам.Вставить(Стр.Ввод, Окр(Физич * (Коэф - 1), 3, РежимОкругления.Окр15как20)); 
		 КонецЕсли;
	 КонецЦикла;
	 // потери на бокс
	 КолСтрок = ДокСсылка.Начисления.Количество();
	 Для каждого Стр Из ДокСсылка.Начисления Цикл	
		 // Долг до этого начисления (включая платежи текущего месяца)
		 Долг = ЭлектроУчет.ЗадолженностьБоксаНаДату(Стр.Бокс, ДокСсылка.Дата - 1);
		 
		 ОблШапка.Параметры.Период = Формат(ДокСсылка.Период, "ДФ='ММММ yyyy'");
		 ОблШапка.Параметры.Бокс = Строка(Стр.Бокс);
		 ОблШапка.Параметры.Собственник = Строка(Стр.Собственник);
		 ТабДок.Вывести(ОблШапка);
		 // показания бокса: из последнего документа показаний ( по ТЧ не хранятся - берём из РС)
		 ТекПоказ = ЭлектроУчет.ТекущееПоказаниеЧисло(СчетчикБокса(Стр.Бокс, ДокСсылка.Период),КонецМесяца(ДокСсылка.Период));
		 ПредПоказ = ЭлектроУчет.ТекущееПоказаниеЧисло(СчетчикБокса(Стр.Бокс, ДокСсылка.Период), НачалоМесяца(ДокСсылка.Период) - 1);
		 // заполнение облБаза
		 ОблНачисления.Параметры.Показания = ?(ПредПоказ = 0, "", Строка(ПредПоказ) + " / ") + Строка(ТекПоказ);
		 ОблНачисления.Параметры.КвтИнд = Стр.КвтИндивидуально;
		 ОблНачисления.Параметры.Тариф = Стр.ТарифПримененный; 
		 ОблНачисления.Параметры.СуммаИнд = Стр.СуммаИндивидуально;
		 
		 ТабДок.Вывести(ОблНачисления);
		 // строки ОДН - только при способе "поровну"
		 Если ДокСсылка.СпособРаспределения = Перечисления.СпособыРаспределенияПерерасхода.ПоровнуНаБоксы Тогда
			 ОблОДН.Параметры.КвтОДН = Стр.КвтОДН;
			 ПотериВвода = ПотериПоВводам.Получить(Стр.Ввод);
			 ОблОДН.Параметры.ПотериСети = ?(ПотериВвода = Неопределено Или КолСтрок = 0, 0,
			 Окр(ПотериВвода / КолСтрок, 1, РежимОкругления.Окр15как20)); //доля на бокс, инфо
			 ОблОДН.Параметры.СуммаОДН = Стр.СуммаОДН;
			 ТабДок.Вывести(ОблОДН);
		 КонецЕсли;
		 ОблИтог.Параметры.СуммаСтроки = Стр.СуммаИтого;
		 ТабДок.Вывести(ОблИтог);
		 
		 ОблИтого.Параметры.Долг = Долг;
		 ОблИтого.Параметры.КОплате = Долг + Стр.СуммаИтого; 
		 ОблИтого.Параметры.ДатаОплаты = Формат(КонецМесяца(ДокСсылка.Период)+ 10*24*60*60, "ДЛФ=D"); // +10 дней
		 ТабДок.Вывести(ОблИтого);
		 ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	 КонецЦикла;
	 Возврат ТабДок;
 КонецФункции 
 Функция СчетчикБокса(Бокс, Момент)
	 Возврат ЭлектроУчет.СчетчикБоксаНаДату(Бокс, Момент);
 КонецФункции
